TexasInstruments/ind-comms-sdk/examples/industrial_comms/iolink_master_demo/example/am261x-lp/r5fss0-0_freertos/example.syscfg
gpio5.$name          = "CONFIG_IOL_TX2";
gpio5.GPIO_n.$assign = "GPIO74";

gpio6.$name          = "CONFIG_IOL_TX3";
gpio6.pinDir         = "OUTPUT";
gpio6.GPIO_n.$assign = "GPIO125";

gpio7.$name          = "CONFIG_IOL_TX4";
gpio7.pinDir         = "OUTPUT";
gpio7.GPIO_n.$assign = "GPIO123";

gpio8.$name          = "CONFIG_IOL_TX5";
gpio8.pinDir         = "OUTPUT";
gpio8.GPIO_n.$assign = "GPIO18";

gpio9.$name          = "CONFIG_IOL_TX6";
gpio9.pinDir         = "OUTPUT";
gpio9.GPIO_n.$assign = "GPIO17";

gpio10.$name          = "CONFIG_IOL_TX7";
gpio10.pinDir         = "OUTPUT";
gpio10.GPIO_n.$assign = "GPIO4";

gpio11.$name          = "CONFIG_IOL_TX8";
gpio11.pinDir         = "OUTPUT";
gpio11.GPIO_n.$assign = "GPIO3";

gpio12.$name          = "CONFIG_IOL_RX1";
gpio12.GPIO_n.$assign = "GPIO71";

gpio13.$name          = "CONFIG_IOL_RX2";
gpio13.GPIO_n.$assign = "GPIO72";

gpio14.$name          = "CONFIG_IOL_RX3";
gpio14.GPIO_n.$assign = "GPIO73";

gpio15.$name          = "CONFIG_IOL_RX4";
gpio15.GPIO_n.$assign = "GPIO16";

gpio16.$name          = "CONFIG_IOL_RX5";
gpio16.GPIO_n.$assign = "GPIO15";

gpio17.$name                        = "CONFIG_IOL_RX6";
gpio17.GPIO_n.$assignAllowConflicts = "GPIO54";
scripting.suppress("Resource conflict,@@@.+?@@@ is also in use by @@@.+?@@@", gpio17, "GPIO_n");

gpio18.$name          = "CONFIG_IOL_RX7";
gpio18.GPIO_n.$assign = "GPIO19";

gpio19.$name          = "CONFIG_IOL_RX8";
gpio19.GPIO_n.$assign = "GPIO133";

gpio20.$name          = "CONFIG_IOL_TXEN1";
gpio20.pinDir         = "OUTPUT";
gpio20.GPIO_n.$assign = "GPIO126";

gpio21.$name          = "CONFIG_IOL_TXEN2";
gpio21.pinDir         = "OUTPUT";
gpio21.GPIO_n.$assign = "GPIO44";

gpio22.$name          = "CONFIG_IOL_TXEN3";
gpio22.pinDir         = "OUTPUT";
gpio22.GPIO_n.$assign = "GPIO6";

gpio23.$name          = "CONFIG_IOL_TXEN4";
gpio23.pinDir         = "OUTPUT";
gpio23.GPIO_n.$assign = "GPIO5";

gpio24.$name                        = "CONFIG_IOL_TXEN5";
gpio24.pinDir                       = "OUTPUT";
gpio24.GPIO_n.$assignAllowConflicts = "GPIO130";

gpio25.$name          = "CONFIG_IOL_TXEN6";
gpio25.pinDir         = "OUTPUT";
gpio25.GPIO_n.$assign = "GPIO106";

gpio26.$name          = "CONFIG_IOL_TXEN7";
gpio26.pinDir         = "OUTPUT";
gpio26.GPIO_n.$assign = "GPIO90";

gpio27.$name          = "CONFIG_IOL_TXEN8";
gpio27.pinDir         = "OUTPUT";
gpio27.GPIO_n.$assign = "GPIO46";

gpio28.$name          = "CONFIG_IOL_ENL1";
gpio28.pinDir         = "OUTPUT";
gpio28.GPIO_n.$assign = "GPIO25";

gpio29.$name          = "CONFIG_IOL_ENL2";
gpio29.pinDir         = "OUTPUT";
gpio29.GPIO_n.$assign = "GPIO81";

gpio30.$name          = "CONFIG_IOL_ENL3";
gpio30.pinDir         = "OUTPUT";
gpio30.GPIO_n.$assign = "GPIO82";

gpio31.$name          = "CONFIG_IOL_ENL4";
gpio31.pinDir         = "OUTPUT";
gpio31.GPIO_n.$assign = "GPIO83";

gpio32.$name          = "CONFIG_IOL_ENL5";
gpio32.pinDir         = "OUTPUT";
gpio32.GPIO_n.$assign = "GPIO45";

gpio33.$name                        = "CONFIG_IOL_ENL6";
gpio33.pinDir                       = "OUTPUT";
gpio33.GPIO_n.$assignAllowConflicts = "GPIO54";
scripting.suppress("Resource conflict,@@@.+?@@@ is also in use by @@@.+?@@@", gpio33, "GPIO_n");

gpio34.$name          = "CONFIG_IOL_ENL7";
gpio34.pinDir         = "OUTPUT";
gpio34.GPIO_n.$assign = "GPIO26";

gpio35.$name          = "CONFIG_IOL_ENL8";
gpio35.pinDir         = "OUTPUT";
gpio35.GPIO_n.$assign = "GPIO80";

gpio36.pinDir         = "OUTPUT";
gpio36.$name          = "CONFIG_IOL_DI_NLD";
gpio36.GPIO_n.$assign = "GPIO1";

gpio37.$name          = "CONFIG_IOL_FAULT1";
gpio37.GPIO_n.$assign = "GPIO53";

gpio38.$name          = "CONFIG_IOL_FAULT2";
gpio38.GPIO_n.$assign = "GPIO58";

gpio39.$name          = "CONFIG_IOL_FAULT3";
gpio39.GPIO_n.$assign = "GPIO55";

gpio40.$name          = "CONFIG_IOL_FAULT4";
gpio40.GPIO_n.$assign = "GPIO56";

gpio41.$name          = "CONFIG_IOL_FAULT5";
gpio41.GPIO_n.$assign = "GPIO57";

gpio42.$name          = "CONFIG_IOL_FAULT6";
gpio42.GPIO_n.$assign = "GPIO63";

gpio43.$name          = "CONFIG_IOL_FAULT7";
gpio43.GPIO_n.$assign = "GPIO22";

gpio44.$name          = "CONFIG_IOL_FAULT8";
gpio44.GPIO_n.$assign = "GPIO21";

eeprom1.peripheralDriver = i2c1;
i2c1.$name               = "CONFIG_I2C_IOL";
i2c1.I2C.$assign         = "I2C0";
i2c1.I2C.SCL.$assign     = "GPIO135";
i2c1.I2C.SDA.$assign     = "GPIO134";
i2c1.I2C_child.$name     = "drivers_i2c_v1_i2c_v1_template0";

i2c2.$name            = "CONFIG_I2C1";
led1.peripheralDriver = i2c2;
i2c2.I2C.$assign      = "I2C1";
i2c2.I2C.SCL.$assign  = "GPIO23";
i2c2.I2C_child.$name  = "drivers_i2c_v1_i2c_v1_template1";

mcspi1.trMode                       = "RX_ONLY";
mcspi1.intrEnable                   = "POLLED";
mcspi1.$name                        = "CONFIG_MCSPI_IOL";
mcspi1.SPI.$assign                  = "SPI2";
mcspi1.SPI.CLK.$assign              = "GPIO129";
mcspi1.SPI.D0.$assignAllowConflicts = "GPIO130";
mcspi1.SPI.D0.$used                 = false;
mcspi1.SPI.D1.$assign               = "GPIO128";
mcspi1.mcspiChannel[0].$name        = "CONFIG_MCSPI_CH1";
mcspi1.mcspiChannel[0].frameFormat  = "POL1_PHA1";
mcspi1.mcspiChannel[0].CSn.$assign  = "GPIO138";
mcspi1.child.$name                  = "drivers_mcspi_v1_mcspi_v1_template1";

edma1.$name                    = "CONFIG_EDMA0";
mcspi1.edmaDriver              = edma1;
edma1.edmaRmDmaCh[0].$name     = "CONFIG_EDMA_RM0";
edma1.edmaRmQdmaCh[0].$name    = "CONFIG_EDMA_RM1";
edma1.edmaRmQdmaCh[0].endIndex = 1;
edma1.edmaRmTcc[0].$name       = "CONFIG_EDMA_RM2";
edma1.edmaRmParam[0].$name     = "CONFIG_EDMA_RM3";

pruicss1.$name    = "CONFIG_PRU_ICSS1";
pruicss1.instance = "ICSSM1";

uart1.$name            = "CONFIG_UART_SMI";
uart1.readMode         = "CALLBACK";
uart1.readCallbackFxn  = "vUartRxCallback";
uart1.writeMode        = "CALLBACK";
uart1.writeCallbackFxn = "vUartTxCallback";
uart1.UART.$assign     = "UART0";
uart1.UART.RXD.$assign = "GPIO27";
uart1.UART.TXD.$assign = "GPIO28";
uart1.child.$name      = "drivers_uart_v2_uart_v2_template0";

mpu_armv71.$name             = "CONFIG_MPU_REGION0";
mpu_armv71.size              = 31;
mpu_armv71.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv71.attributes        = "Device";
mpu_armv71.allowExecute      = false;

